In [69]:
""" File database """
from google.colab import drive
drive.mount('/content/drive')
pathdb = "/content/drive/My Drive/Colab Notebooks/iykra.db"
path_dataset_a = "/content/drive/My Drive/Colab Notebooks/datasetA.csv"
path_dataset_b = "/content/drive/My Drive/Colab Notebooks/dataset2.csv"
path_dataset_c = "/content/drive/My Drive/Colab Notebooks/dataset3.json"

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [222]:
import csv
import json
import sqlite3
import pandas as pd 
from sqlite3 import Error

In [176]:
class IYKRA(): 
    conn = None

    def __init__(self,db_file):
        
        try:
            self.conn = sqlite3.connect(db_file)
            print(sqlite3.version)
        except Exception as e:
            print(e)
        
    def read_csv(self,fname):
        file = open(fname)
        data = csv.reader(file, delimiter=';')
        next(data)
        return data

    def read_json(self,fname):
        file = open(fname)
        raw = json.load(file)
        data = []
        for i in range(len(raw)):
            data.append(raw[i])
        return data

    def create_table(self, create_table_sql):
        """ create a table from the create_table_sql statement
            :param conn: Connection object
            :param create_table_sql: a CREATE TABLE statement
            :return:
        """
        try:
            self.conn.execute(f'\'{create_table_sql}\'')
        except Exception as e:
            print(e)
        else:
            self.conn.commit()
            print("success")
            

    def insert_data(self, insert_sql):
        try:
            self.conn.execute(insert_sql)
        except Exception as e:
            print(e)
        else:
            self.conn.commit()
            print("success")
        
    
    def show_data(self, show_qry):
        try:
            data_row = self.conn.execute(show_qry)
        except Exception as e:
            print(e)
        else:
            return data_row

    def convert_to_sql(self,params):
        col = ''
        for i in range(len(params["columns"])):
            for kolom in params['columns'][i].values():
                col += f"{kolom} "
            if i < (len(params["columns"])-1):
                col += ','

        qry = f"CREATE TABLE IF NOT EXISTS {params['table_name']} ({col})"
        return qry

In [177]:
""" create instance """
latihan = IYKRA(pathdb)

2.6.0

**SOAL PERTAMA**

In [12]:
""" DATASET A"""
params = {
    "table_name" : "transactions",
    "columns" : [
                 {
                     "name" : "id",
                     "type" : "UUID"
                 },
                 {
                     "name" : "insert_time",
                     "type" : "TIMESTAMP"
                 },
                 {
                     "name" : "tx_amount",
                     "type" : "FLOAT"
                 },
                 {
                     "name" : "tx_type",
                     "type" : "STRING"
                 },
                 {
                     "name" : "status",
                     "type" : "STRING"
                 }
    ]
}

In [138]:
""" create table Dataset A"""
latihan.create_table(latihan.convert_to_sql(params))

success

In [148]:
""" read data Dataset A"""
datasetA = latihan.read_csv(path_dataset_a)

In [149]:
"""INSERTA DATA PARAMA"""
qry = ""
for dataA in datasetA:
    qry = f"INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('{dataA[0]}','{dataA[1]}','{dataA[2]}','{dataA[3]}','{dataA[4]}')"
    print(qry)
    latihan.insert_data(qry)

INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('1','2020-08-03','32000','buy','close')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('5','2020-08-04','1200','buy','open')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('2','2020-08-05','27600','buy','open')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('3','2020-08-06','32000','buy','open')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('4','2020-08-01','2000','buy','open')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('2','2020-08-11','45400','buy','close')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('3','2020-08-09','76000','buy','close')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('5','2020-08-10','87900','buy','close')
success
INSERT INTO transactions (id, insert_time, tx_amount, tx_type, status) VALUES ('6','2020-08-20','89990','buy','open')
success

In [151]:
""" show table Dataset A"""
qry = " SELECT * from transactions group by id having max(insert_time) "
rows = latihan.show_data(qry)
for row in rows:
    print(row)

(1, '2020-08-03', 32000.0, 'buy', 'close')
(2, '2020-08-11', 45400.0, 'buy', 'close')
(3, '2020-08-09', 76000.0, 'buy', 'close')
(4, '2020-08-01', 2000.0, 'buy', 'open')
(5, '2020-08-10', 87900.0, 'buy', 'close')
(6, '2020-08-20', 89990.0, 'buy', 'open')

**SOAL KEDUA**

In [163]:
""" DATASET B"""
params = {
    "table_name" : "sales",
    "columns" : [
                 {
                     "name" : "insert_time",
                     "type" : "TIMESTAMP"
                 },
                 {
                     "name" : "total",
                     "type" : "FLOAT"
                 }
    ]
}

In [158]:
""" create table Dataset B"""
latihan.create_table(latihan.convert_to_sql(params))

success

In [167]:
""" read data Dataset A"""
datasetB = latihan.read_csv(path_dataset_b)

In [168]:
"""INSERTA DATA PARAMA"""
qry = ""
for dataB in datasetB:
    qry = f"INSERT INTO sales (insert_time, total) VALUES ('{dataB[0]}','{dataB[1]}')"
    print(qry)
    latihan.insert_data(qry)

INSERT INTO sales (insert_time, total) VALUES ('02/07/20','2000')
success
INSERT INTO sales (insert_time, total) VALUES ('02/07/20','5000')
success
INSERT INTO sales (insert_time, total) VALUES ('04/07/20','7000')
success
INSERT INTO sales (insert_time, total) VALUES ('04/07/20','6000')
success
INSERT INTO sales (insert_time, total) VALUES ('06/07/20','8000')
success
INSERT INTO sales (insert_time, total) VALUES ('07/07/20','13000')
success
INSERT INTO sales (insert_time, total) VALUES ('08/07/20','5000')
success
INSERT INTO sales (insert_time, total) VALUES ('08/07/20','76000')
success
INSERT INTO sales (insert_time, total) VALUES ('08/07/20','56000')
success
INSERT INTO sales (insert_time, total) VALUES ('11/07/20','2000')
success
INSERT INTO sales (insert_time, total) VALUES ('12/07/20','45000')
success
INSERT INTO sales (insert_time, total) VALUES ('13/07/20','78900')
success
INSERT INTO sales (insert_time, total) VALUES ('13/07/20','12000')
success
INSERT INTO sales (insert_time, total) VALUES ('13/07/20','37000')
success
INSERT INTO sales (insert_time, total) VALUES ('13/07/20','9800')
success
INSERT INTO sales (insert_time, total) VALUES ('17/07/20','10000')
success
INSERT INTO sales (insert_time, total) VALUES ('18/07/20','7600')
success
INSERT INTO sales (insert_time, total) VALUES ('19/07/20','2500')
success

In [172]:
""" show table Dataset A"""
qry = " SELECT insert_time as date,sum(total) as totalsale from sales group by insert_time "
rows = latihan.show_data(qry)
for row in rows:
    print(row)

('02/07/20', 7000.0)
('04/07/20', 13000.0)
('06/07/20', 8000.0)
('07/07/20', 13000.0)
('08/07/20', 137000.0)
('11/07/20', 2000.0)
('12/07/20', 45000.0)
('13/07/20', 137700.0)
('17/07/20', 10000.0)
('18/07/20', 7600.0)
('19/07/20', 2500.0)

**SOAL 3**

In [187]:
""" read json file """
datas = latihan.read_json(path_dataset_c)

In [233]:
""" soal 1 """
user_id = []
txs_id = []
for i in range(len(datas)):
    for j in range(len(datas[i]['txs'])):
        user_id.append(datas[i]['user']['id'])
        txs_id.append(datas[i]['txs'][j]['id'])

data_dict1 = {'user_id':user_id,'txs_id':txs_id}
df = pd.DataFrame(data_dict1) 

# saving the dataframe 
df.to_csv('/content/drive/My Drive/Colab Notebooks/soal1.csv')

In [234]:
df

   user_id  txs_id
0        1       1
1        1       3
2        1       5
3        2       2
4        2       4
5        2       6

In [235]:
""" soal 2 """
user_id = []
name = []
email = []

for i in range(len(datas)):
    user_id.append(datas[i]['user']['id'])
    name.append(datas[i]['user']['name'])
    email.append(datas[i]['user']['email'])
    
data_dict2 = {'user_id':user_id,'name':name,'email':email}
df = pd.DataFrame(data_dict2) 

# saving the dataframe 
df.to_csv('/content/drive/My Drive/Colab Notebooks/soal2.csv')

In [236]:
df

   user_id  name             email
0        1  agus  agus@example.com
1        2  asep  asep@example.com

In [239]:
""" soal 3 """
txs_id = []
txs_date = []
txs_amount = []
txs_type = []

for i in range(len(datas)):
    for j in range(len(datas[i]['txs'])):
        txs_id.append(datas[i]['txs'][j]['id'])
        txs_date.append(datas[i]['txs'][j]['tx_date'])
        txs_amount.append(datas[i]['txs'][j]['tx_amount'])
        txs_type.append(datas[i]['txs'][j]['tx_type'])
    
data_dict3 = {'txs_id':txs_id,'txs_date':txs_date,'txs_amount':txs_amount,'txs_type':txs_type}
df = pd.DataFrame(data_dict3) 

# saving the dataframe 
df.to_csv('/content/drive/My Drive/Colab Notebooks/soal3.csv')

In [240]:
df

   txs_id    txs_date  txs_amount txs_type
0       1  2020-01-01          10      buy
1       3  2020-02-01          10      buy
2       5  2020-03-01          20     sell
3       2  2020-01-01          10     sell
4       4  2020-02-01          10     sell
5       6  2020-03-01          20      buy